* Purescript Bindings
  :LOGBOOK:
  CLOCK: [2019-07-07 Sun 09:37]--[2019-07-07 Sun 12:23] =>  2:46
  CLOCK: [2019-07-06 Sat 11:20]--[2019-07-06 Sat 13:29] =>  2:09
  CLOCK: [2019-07-05 Fri 09:12]--[2019-07-05 Fri 11:15] =>  2:03
  CLOCK: [2019-07-03 Wed 11:07]--[2019-07-03 Wed 13:44] =>  2:37
  CLOCK: [2019-07-02 Tue 09:13]--[2019-07-02 Tue 12:48] =>  3:35
  CLOCK: [2019-07-01 Mon 12:27]--[2019-07-01 Mon 21:30] =>  9:03
  CLOCK: [2019-06-30 Sun 18:43]--[2019-06-30 Sun 20:34] =>  1:51
  :END:
# TODO: remove obsolete code, the toArray functionality for HTMLCollection
# and NodeList has side-effects that prevent the setting of eg. class names
# on the corresponding elements. Can remove the experimental code, see the
# resetActive function for the differences. Put the css-code into this file
# as well and tangle it out, too

Functions to bind to the nav-menu to get some functionality. There are two
functions currently:
 - An Activation Listener :: 
   When clicking an anchor in a list item in a menu, this anchor becomes
   active by setting class /active/ on it. This is like a focus in the sense
   that all other anchors in the menu become inactive.
 - An Expansion Listener ::
   When clicking an anchor in a menu, the class /expanded/ is toggled for that
   anchor. Styling is used to expand the sub-menu for that anchor while it is
   expanded. Other than with activation, several anchors can be expanded at
   the same time.
